# Offset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpacingRule..::..Offset Property
SpacingRule Class See Also
---
An additional offset applied to the first gridline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Offset { get; set; }
```

Visual Basic
---
```text
Public Property Offset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Offset {
	double get ();
	void set (double value);
}
```

# Remarks
Measured in feet. Must be between -30000' and 30000'.
# See Also
SpacingRule Class
Autodesk.Revit.DB Namespace